Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.64/edc/PIC32MZ1064DAA288.PIC
      <edc:SFRDef edc:_addr="0x1F8E2020" edc:_begin="0x0" edc:_end="0x3c" edc:_modsrc="DOS-EIP-00206r5-sqi-v2.Module" edc:_refcount="1" edc:access="--------------------nnnnnnnnnnnn" edc:cname="SQI1INTSTAT" edc:desc="" edc:impl="0xfff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------000010101101" edc:name="SQI1INTSTAT" edc:nzwidth="32" edc:por="--------------------000010101101" ltx:memberofperipheral="SQI1">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXEMPTYIF" edc:desc="Transmit Buffer Empty Interrupt Status bit" edc:mask="0x1" edc:name="TXEMPTYIF" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="The transmit buffer is empty" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="The transmit buffer has content" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TXFULLIF" edc:desc="Transmit Buffer Full Interrupt Status bit" edc:mask="0x1" edc:name="TXFULLIF" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="The transmit buffer is full" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="The transmit buffer is not full" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TXTHRIF" edc:desc="Transmit Buffer Threshold Interrupt Status bit" edc:mask="0x1" edc:name="TXTHRIF" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="Transmit buffer has more than TXINTTHR words of space available" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Transmit buffer has less than TXINTTHR words of space available" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RXEMPTYIF" edc:desc="Receive Buffer Empty Interrupt Status bit" edc:mask="0x1" edc:name="RXEMPTYIF" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="Receive buffer is empty" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Receive buffer is not empty" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RXFULLIF" edc:desc="Receive Buffer Full Interrupt Status bit" edc:mask="0x1" edc:name="RXFULLIF" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="Receive buffer is full" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Receive buffer is not full" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RXTHRIF" edc:desc="Receive Buffer Threshold Interrupt Status bit" edc:mask="0x1" edc:name="RXTHRIF" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="Receive buffer has RXINTTHR or more words of space available" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Receive buffer has less than RXINTTHR words of space available" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CONFULLIF" edc:desc="Control Buffer Full Interrupt Status bit" edc:mask="0x1" edc:name="CONFULLIF" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="Control buffer is full" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Control buffer is not full" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CONEMPTYIF" edc:desc="Control Buffer Empty Interrupt Status bit" edc:mask="0x1" edc:name="CONEMPTYIF" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="Control buffer is empty" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="Control buffer is not empty" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CONTHRIF" edc:desc="Control Buffer Threshold Interrupt Status bit" edc:mask="0x1" edc:name="CONTHRIF" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="The control buffer has THRES or more words of space available" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="The control buffer has less than THRES words of space available" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="BDDONEIF" edc:desc="DMA Buffer Descriptor Done Interrupt Status bit" edc:mask="0x1" edc:name="BDDONEIF" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="DMA BD process is done" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="DMA BD process is in progress" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PKTCOMPIF" edc:desc="DMA Buffer Descriptor Processor Packet Complete Interrupt Status bit" edc:mask="0x1" edc:name="PKTCOMPIF" edc:nzwidth="1">
              <edc:SFRFieldSemantic edc:desc="DMA BD packet is complete" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="DMA BD packet is in progress" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DMAEIF" edc:desc="DMA Bus Error Interrupt Flag bit" edc:mask="0x1" edc:name="DMAEIF" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:desc="DMA bus error has occurred" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:desc="DMA bus error has not occurred" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E2024" edc:_begin="0x0" edc:_end="0x3c" edc:_modsrc="DOS-EIP-00206r5-sqi-v2.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SQI1TXDATA" edc:desc="SQI Transmit Data Buffer Register" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="SQI1TXDATA" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SQI1">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXDATA" edc:desc="Transmit Command Data bits. Data is loaded into this register before being transmitted." edc:mask="0xffffffff" edc:name="TXDATA" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
