Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.64/edc/PIC32MZ1064DAA288.PIC
      <edc:SFRDef edc:_addr="0x1F8EA6BC" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCLUT175" edc:desc="" edc:impl="0x00ffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------000000000000000000000000" edc:name="GLCDCLUT175" edc:nzwidth="32" edc:por="--------000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BLUE" edc:desc="" edc:mask="0xff" edc:name="BLUE" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="GREEN" edc:desc="" edc:mask="0xff" edc:name="GREEN" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="RED" edc:desc="" edc:mask="0xff" edc:name="RED" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA6C0" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCLUT176" edc:desc="" edc:impl="0x00ffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------000000000000000000000000" edc:name="GLCDCLUT176" edc:nzwidth="32" edc:por="--------000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BLUE" edc:desc="" edc:mask="0xff" edc:name="BLUE" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="GREEN" edc:desc="" edc:mask="0xff" edc:name="GREEN" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="RED" edc:desc="" edc:mask="0xff" edc:name="RED" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA6C4" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCLUT177" edc:desc="" edc:impl="0x00ffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------000000000000000000000000" edc:name="GLCDCLUT177" edc:nzwidth="32" edc:por="--------000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BLUE" edc:desc="" edc:mask="0xff" edc:name="BLUE" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="GREEN" edc:desc="" edc:mask="0xff" edc:name="GREEN" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="RED" edc:desc="" edc:mask="0xff" edc:name="RED" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA6C8" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCLUT178" edc:desc="" edc:impl="0x00ffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------000000000000000000000000" edc:name="GLCDCLUT178" edc:nzwidth="32" edc:por="--------000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BLUE" edc:desc="" edc:mask="0xff" edc:name="BLUE" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="GREEN" edc:desc="" edc:mask="0xff" edc:name="GREEN" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="RED" edc:desc="" edc:mask="0xff" edc:name="RED" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA6CC" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCLUT179" edc:desc="" edc:impl="0x00ffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------000000000000000000000000" edc:name="GLCDCLUT179" edc:nzwidth="32" edc:por="--------000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BLUE" edc:desc="" edc:mask="0xff" edc:name="BLUE" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="GREEN" edc:desc="" edc:mask="0xff" edc:name="GREEN" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="RED" edc:desc="" edc:mask="0xff" edc:name="RED" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA6D0" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCLUT180" edc:desc="" edc:impl="0x00ffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------000000000000000000000000" edc:name="GLCDCLUT180" edc:nzwidth="32" edc:por="--------000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BLUE" edc:desc="" edc:mask="0xff" edc:name="BLUE" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="GREEN" edc:desc="" edc:mask="0xff" edc:name="GREEN" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="RED" edc:desc="" edc:mask="0xff" edc:name="RED" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA6D4" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCLUT181" edc:desc="" edc:impl="0x00ffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------000000000000000000000000" edc:name="GLCDCLUT181" edc:nzwidth="32" edc:por="--------000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BLUE" edc:desc="" edc:mask="0xff" edc:name="BLUE" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="GREEN" edc:desc="" edc:mask="0xff" edc:name="GREEN" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="RED" edc:desc="" edc:mask="0xff" edc:name="RED" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA6D8" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCLUT182" edc:desc="" edc:impl="0x00ffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------000000000000000000000000" edc:name="GLCDCLUT182" edc:nzwidth="32" edc:por="--------000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BLUE" edc:desc="" edc:mask="0xff" edc:name="BLUE" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="GREEN" edc:desc="" edc:mask="0xff" edc:name="GREEN" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="RED" edc:desc="" edc:mask="0xff" edc:name="RED" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA6DC" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCLUT183" edc:desc="" edc:impl="0x00ffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------000000000000000000000000" edc:name="GLCDCLUT183" edc:nzwidth="32" edc:por="--------000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BLUE" edc:desc="" edc:mask="0xff" edc:name="BLUE" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="GREEN" edc:desc="" edc:mask="0xff" edc:name="GREEN" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="RED" edc:desc="" edc:mask="0xff" edc:name="RED" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA6E0" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCLUT184" edc:desc="" edc:impl="0x00ffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------000000000000000000000000" edc:name="GLCDCLUT184" edc:nzwidth="32" edc:por="--------000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BLUE" edc:desc="" edc:mask="0xff" edc:name="BLUE" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="GREEN" edc:desc="" edc:mask="0xff" edc:name="GREEN" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="RED" edc:desc="" edc:mask="0xff" edc:name="RED" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA6E4" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCLUT185" edc:desc="" edc:impl="0x00ffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------000000000000000000000000" edc:name="GLCDCLUT185" edc:nzwidth="32" edc:por="--------000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BLUE" edc:desc="" edc:mask="0xff" edc:name="BLUE" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="GREEN" edc:desc="" edc:mask="0xff" edc:name="GREEN" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="RED" edc:desc="" edc:mask="0xff" edc:name="RED" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA6E8" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCLUT186" edc:desc="" edc:impl="0x00ffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------000000000000000000000000" edc:name="GLCDCLUT186" edc:nzwidth="32" edc:por="--------000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BLUE" edc:desc="" edc:mask="0xff" edc:name="BLUE" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="GREEN" edc:desc="" edc:mask="0xff" edc:name="GREEN" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="RED" edc:desc="" edc:mask="0xff" edc:name="RED" edc:nzwidth="8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
